# SetFillGrids Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FillPattern..::..SetFillGrids Method
FillPattern Class See Also
---
Set the fill grids in this fill pattern.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetFillGrids(
	IList<FillGrid> fillGrids
)
```

Visual Basic
---
```text
Public Sub SetFillGrids ( _
	fillGrids As IList(Of FillGrid) _
)
```

Visual C++
---
```text
public:
void SetFillGrids(
	IList<FillGrid^>^ fillGrids
)
```

# ### Parameters
fillGrids
    Type: System.Collections.Generic..::..IList<(Of <(<'FillGrid>)>)> The fill grids to be used.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FillPattern Class
Autodesk.Revit.DB Namespace